#+TITLE: HTML Note:

*** TODO Emacs
DEADLINE: <2021-05-31 Mon> SCHEDULED: <2021-01-08 Fri>
1. 文本处理基本操作
   *bold*
   /italic/
   +strike-through+
   =inline code=
2. 链接与图片
   两层[[][]]来插入超链接  [[http://www.baidu.com][Title]]
   图片和链接类似，直接输入图片的完整地址即可
3. 在 orgmode 里面做表格处理, C-c }可以开启行符, 按 C-c C-c
   | year | Revenue |
   |------+---------|
   | 2017 | 1500000 |
   | 2018 | 3000000 |
   | 2019 | 6000000 |
   |------+---------|
   |  Sum |         |
   #+TBLFM： @5$2=vsum(@2..@-1)

   可以使用-calc， elisp 的函数功能
4. 编写技术文档：a.k.a. Jupyter Notebook, 可以使用 C-c C-c 来运行
#+Begin_src python
def my_sum(r):
    sum = 0
    for i in range(r):
        sum += i
    return sum

return my_sum(100)
#+End_src

#+RESULTS:
: 4950
5. 支持绘图，a.k.a. Omni Graffle
   使用 ditaa， homebrew 可以直接安装  需要研究！ C-c C-c 来执行
   #+begin_src ditaa: file images/chart.png

   #+end_src
6. 画图软件 graphviz/dot 用的也比较多
   - =artist_mode=
   - =picture_mode=
7. 任务管理
   - Getting things dome
   + =Org-capture     C-c C-c / 打开 Agenda 查看 TODO
8. 直接查看 pdf，可以导出很多格式。
   #+OPTIONS: toc:nil
9. 导出幻灯片，
   #+BEAMER_THEME： Boadilla
